from rich.console import Console
console = Console()
task_list = """
1) Зформуйте строку, яка містить певну інформацію про символ в відомому слові. 
Наприклад "The [значення нокра символа] symbol in [тут слово] is '[символ з відповідним порядковим номером]'". 
Слово та номер отримайте за допомогою input() або скористайтеся константою. 
Наприклад (слово - "Python" а номер символу 3) - "The 3 symbol in "Python" is 't' ".

2) Вести з консолі строку зі слів (або скористайтеся константою). 
Напишіть код, який визначить кількість кількість слів, в цмх даних.

3) Існує ліст з різними даними, наприклад lst1 = ['1', '2', 3, True, 'False', 5, '6', 7, 8, 'Python', 9, 'Lorem Ipsum']. 
Напишіть механізм, який сфлрмує новий list (наприклад lst2), який би містив всі числові змінні, які є в lst1. 
Майте на увазі, що данні в lst1 не є статичними можуть змінюватись від запуску до запуску.
==========================================================================================================="""

task_number = "[green]Введіть номер завдання для перевірки або 'exit' для завершення перевірки дз: [/green]"
task_check = ["1", "2", "3", "exit"]
command_error = "Невідома команда, повтори спробу!!!"
task_continue = ["Для продовження перевірки 'continue', для завершення 'exit': ",["continue", "exit"]]

create_list = """Список доступних методів створення списку
full_rand - цілком випадкова генерація списку
type_rand - випадкове визначення типу даних у кожному пункті списку, але ручне заповнення
value_rand - випадкове наповнення списку, ручна вказівка типу даних
manual - повністю ручний список
Виберіть тип: """
type_list = ["full_rand","type_rand","value_rand","manual"]

search_type = ["""Дані для формування списку
int - список цілих чисел
str - список рядків
float - список чисел з цифрою після коми
bool - список із логічних частин списку
all - зробити списки по кожному окремому типу даних
Виберіть тип списку: """,["int", "str", "float", "bool","all"]]

