import all_func

# Напишіть программу "Касир в кінотеватрі", яка буде виконувати наступне:
# Попросіть користувача ввести свсвій вік (можно використати константу або input()).
# - якщо користувачу менше 7 - вивести "Де твої батьки?"
# - якщо користувачу менше 16 - вивести "Це фільм для дорослих!"
# - якщо користувачу більше 65 - вивести "Покажіть пенсійне посвідчення!"
# - якщо вік користувача складається з однакових цифр (11, 22, 44 і тд років) - вивести "Який цікавий вік!"
# - у будь-якому іншому випадку - вивести "А білетів вже немає!"


while True:
    buyer_age = all_func.get_any_type("Укажите ваш возраст: ", "int")
    if buyer_age < 7:
        print("Где твои родители?")
    elif buyer_age < 16:
        if all_func.check_palindrome(buyer_age):
            print("Какой прекрасный возвраст, но это фильм для взрослых!")
        else:
            print("Это фильм для взрослых!")
    elif buyer_age >= 65:
        if buyer_age > 122:
            print("По вам книга рекордов Гинесса плачет")
        if all_func.check_palindrome(buyer_age):
            print("У вас прекрасный возвраст, пожалуйста, покажите пенсионное удостоверение!")
        else:
            print("Пожалуйста, покажите пенсионное удостоверение!")
    else:
        if all_func.check_palindrome(buyer_age):
            print("У вас прекрасный возвраст, но нужно было приходить раньше, билетов больше нет!")
        else:
            print("Нужно было приходить раньше, билетов больше нет!")

    check_task = ""
    while True:
        check_task = input("Для продолжения проверки 'continue', для завершения 'end': ")
        if check_task == "continue" or check_task == "end":
            break
        else:
            print("Не верная команда, необходимо указать 'continue' или 'end', пробуй ещё!")
    if check_task == "end":
        print("Спасибо за проверку!")
        break
    else:
        print("Удачной проверки!")
